Autodesk.AutoCAD.ApplicationServices.BeginExtractionEventArgs
This class provides data for the BeginExtraction event of the Application.Core class.

Autodesk.AutoCAD.ApplicationServices.BeginExtractionEventArgs.#ctor(AcDwgExtractor.BeginExtractionEventArgs*)
Constructor.

Autodesk.AutoCAD.ApplicationServices.BeginExtractionEventArgs.QueueForExtraction(Autodesk.AutoCAD.DatabaseServices.ObjectId,System.String)
Queues an object for property extraction. The properties extracted are subject to change.
Note: For APS Design Automation Use only.
idObject: Input Object ID of the object queue for property extraction
viewableId: Input string of the viewable ID