Autodesk.AutoCAD.ApplicationServices.Core.Application.BeginExtraction
Wraps the AcDwgExtractor::ExtractorReactor::beginExtraction() ObjectARX function.

Autodesk.AutoCAD.ApplicationServices.Core.Application.EndExtraction
Wraps the AcDwgExtractor::ExtractorReactor::endExtraction() ObjectARX function.

Autodesk.AutoCAD.ApplicationServices.Core.Application.IsAdpDisabled
Checks whether ADP instrumentation is disabled.