Autodesk.AutoCAD.GraphicsSystem.Manager.GetActiveModels(Autodesk.AutoCAD.DatabaseServices.Database)
Gets an array of active "main" graphics models for a database.
db: Input database
Returns: Array of Model objects.

Autodesk.AutoCAD.GraphicsSystem.Manager.ActiveGraphicsKernels
Gets an array of active graphics kernels.

Autodesk.AutoCAD.GraphicsSystem.Manager.ActiveModels
Gets an array of active graphics models.