Autodesk.AutoCAD.ApplicationServices.EndExtractionEventArgs
This class provides data for the EndExtraction event of the Application.Core class.

Autodesk.AutoCAD.ApplicationServices.EndExtractionEventArgs.#ctor(AcDwgExtractor.EndExtractionEventArgs*)
Constructor.

Autodesk.AutoCAD.ApplicationServices.EndExtractionEventArgs.AddProperty(Autodesk.AutoCAD.DatabaseServices.ObjectId,System.String,System.String,System.Object,System.String,System.Boolean)
Adds a property to the property database.
idObject:  Input Object ID of the object that has this property
propertyCategory:  Input string of the category for the property
propertyName:  Input string of the name for the property
propertyValue:  Input value for the property
units:  Input string of the units for the property
hidden:  Input boolean that indicates whether the property is intended for the user to see