Autodesk.AutoCAD.ApplicationServices.InplaceTextEditor.ForcedOpaqueBackground
This wraps the ObjectARX AcEdInplaceTextEditor::forcedOpaqueBackground() method.

Autodesk.AutoCAD.ApplicationServices.InplaceTextEditor.Wysiwyg
This wraps the ObjectARX AcEdInplaceTextEditor::wysiwyg() and AcEdInplaceTextEditor::enableWysiwyg() methods.

Autodesk.AutoCAD.ApplicationServices.InplaceTextEditor.UndoRecordingDisabled
This wraps the ObjectARX AcEdInplaceTextEditor::undoRecordingDisabled() and AcEdInplaceTextEditor::setUndoRecordingDisable() methods.