Autodesk.AutoCAD.Windows.StatusBarItem.DisplayContextMenu(System.Windows.Forms.ContextMenuStrip,System.Drawing.Point)
Displays the specified context menu at the specified point. The point is expressed in status bar client coordinates.
menu: Input context menu to display
p: Input point at which to display the menu